% Systima Diagnosis Sakxarodi Diabiti Me Proteinomeni Therapeia 

% Metaxioti Maria TP4324 

% Dinamiki Vasi Gnosis - Dynamic Knowledge Base 

 

 

% Diloseis katigorimaton 

 

:-dynamic rules/1, max_ruleID/1, rule/3.    %Dinamika katigorimata 

rules([rID1, rID2, rID3, rID4, rID5, rID6, rID7, rID8, rID9, rID10, rID11, rID12, rID13, 

    rID14, rID15, rID16, rID17, rID18, rID19, rID20, rID21, rID22, rID23, rID24, rID25, 

    rID26, rID27, rID28, rID29, rID30, rID31, rID32, rID33, rID34, rID35, rID36, rID37, 

    rID38, rID39, rID40, rID41, rID42, rID43, rID44, rID45, rID46, rID47, rID48]).            %Katigorima rules me orisma lista me ton kodiko anagnorisis tou kathe kanona 

max_ruleID(48).                              %Katigorima max_ruleID me orisma ton kodiko anagnorisis tou megaliterou/teleutaiou kanona pou exei prostethei 

 

 

% Knowledge Base - Vasi Gnosis 

 

% Gia ti Diagnosi xrisimopoieitai to motivo kanona: 

% rule(RuleID, values((Symptomata,  

%       Polyouria, Polydipsia, ApoleiaVarous, Koposi, 

%       TholiOrasi, Moudiasma, Pliges, 

%       YpervarosPaxisarkos, HlikiaAnw45, OikogeneiakoIstoriko, 

%       YpsiliArtiriakiPiesi, XamiliHDLYpsilaTriglykeridia, SwmatikaMiEnergos,  

%       IstorikoDiavitiKiisisIMwroPanwApo4Kila, SyndromoPolykistikwnOothikwn,  

%       IstorikoKardiakwnPathisewnIEgkefaliko, Katathlipsi, MelanizousaAkanthosi, 

%       PrwtosElegxos, DeuterosElegxos,  

%       EntoniParousiaKetonwnOura, ParousiaAutoantiswmatwnNisidwn)),Answer). 

% 

% Opou: ruleID - Kodikos Anagnorisis tou kathe kanona 

%       Symptomata - Orisma(me apantisi yes/no) pou dilwnei ean o asthenis exei simptomata i oxi 

%       Polyouria,Polydipsia, ApoleiaVarous, Koposi, TholiOrasi, Moudiasma, Pliges - 

%           Orismata(me apantisi yes/no/unknown) pou antiprosopeuoun xaraktiristika simptomata tis asthenias 

%       YpervarosPaxisarkos, HlikiaAnw45, OikogeneiakoIstoriko, 

%       YpsiliArtiriakiPiesi, XamiliHDLYpsilaTriglykeridia, SwmatikaMiEnergos,  

%       IstorikoDiavitiKiisisIMwroPanwApo4Kila, SyndromoPolykistikwnOothikwn,  

%       IstorikoKardiakwnPathisewnIEgkefaliko, Katathlipsi, MelanizousaAkanthosi -  

%           Orismata(me apantisi yes/no/unknown) pou antiproswpeuoun tous paragontes kindinou emfanisis tis asthenias 

%       PrwtosElegxos, DeuterosElegxos - Orismata(me apantiseis: first/second/third/unknown) pou  

%           antiproswpeuoun tin katigoriopoiisi twn apotelesmatwn twn aimatologikwn eksetasewn se 3 katigories, first: Apotelesmata=<99, second: 100=<Apotelesmata=<125, third: Apotelesmata=<126 

%       EntoniParousiaKetonwnOura, ParousiaAutoantiswmatwnNisidwn -  

%           Orismata(me apantisi yes/no/unknown) pou antiproswpeuoun ean oi ergastiriakes times twn eksetasewn gia elegxo iparxis 

%           twn sigkekrimenwn ousiwn feroun anisixitika noumera stin periptosi twn ketonwn i genikoteri 

%           iparksi kapoiou Autoantisomatos Nisidwn stin periptos twn Autoantisomatwn Nisidwn 

%       Answer - Orisma(me apantisi se morfi keimenou) pou epistrefei tin Diagnosi tou asthenous kai pithani 

%           proteinomeni therapeia 

 

 

 

% Asthenis me asindeta aisthita simptomata 

rule(rID1, values((yes, no, no, no, no, no, no, no, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _ )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής δεν φαίνεται να έχει κάποιο από τα συμπτώματα που συνδέονται με τον ΣΔ.'). 

% Asthenis me symptomata alla prwta apotelesmata se proti katigoria 

rule(rID2, values((yes, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, first, _, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων είναι σε φυσιολογικά επίπεδα. Ο ασθενής δεν φαίνεται να έχει ΣΔ Τύπου 1 ή 2.'). 

rule(rID3, values((yes, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, first, _, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων είναι σε φυσιολογικά επίπεδα. Ο ασθενής δεν φαίνεται να έχει ΣΔ Τύπου 1 ή 2.'). 

rule(rID4, values((yes, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, first, _, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων είναι σε φυσιολογικά επίπεδα. Ο ασθενής δεν φαίνεται να έχει ΣΔ Τύπου 1 ή 2.'). 

rule(rID5, values((yes, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, first, _, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων είναι σε φυσιολογικά επίπεδα. Ο ασθενής δεν φαίνεται να έχει ΣΔ Τύπου 1 ή 2.'). 

rule(rID6, values((yes, no, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, first, _, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων είναι σε φυσιολογικά επίπεδα. Ο ασθενής δεν φαίνεται να έχει ΣΔ Τύπου 1 ή 2.'). 

rule(rID7, values((yes, no, no, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, first, _, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων είναι σε φυσιολογικά επίπεδα. Ο ασθενής δεν φαίνεται να έχει ΣΔ Τύπου 1 ή 2.'). 

rule(rID8, values((yes, no, no, no, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, first, _, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων είναι σε φυσιολογικά επίπεδα. Ο ασθενής δεν φαίνεται να έχει ΣΔ Τύπου 1 ή 2.'). 

 

% Asthenis me symptomata alla prwta apotelesmata deuteris katigorias kai deutera apotelesmata protis katigorias 

rule(rID9, values((yes, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, second, first, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων είναι σε φυσιολογικά επίπεδα. Ο ασθενής δεν φαίνεται να έχει ΣΔ Τύπου 1 ή 2.'). 

rule(rID10, values((yes, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, second, first, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων είναι σε φυσιολογικά επίπεδα. Ο ασθενής δεν φαίνεται να έχει ΣΔ Τύπου 1 ή 2.'). 

rule(rID11, values((yes, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, second, first, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων είναι σε φυσιολογικά επίπεδα. Ο ασθενής δεν φαίνεται να έχει ΣΔ Τύπου 1 ή 2.'). 

rule(rID12, values((yes, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, second, first, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων είναι σε φυσιολογικά επίπεδα. Ο ασθενής δεν φαίνεται να έχει ΣΔ Τύπου 1 ή 2.'). 

rule(rID13, values((yes, no, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, second, first, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων είναι σε φυσιολογικά επίπεδα. Ο ασθενής δεν φαίνεται να έχει ΣΔ Τύπου 1 ή 2.'). 

rule(rID14, values((yes, no, no, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, second, first, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων είναι σε φυσιολογικά επίπεδα. Ο ασθενής δεν φαίνεται να έχει ΣΔ Τύπου 1 ή 2.'). 

rule(rID15, values((yes, no, no, no, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, second, first, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων είναι σε φυσιολογικά επίπεδα. Ο ασθενής δεν φαίνεται να έχει ΣΔ Τύπου 1 ή 2.'). 

 

% Asthenis me symptomata, prwta apotelesmata se deuteri katigoria kai deutera se deuteri 

rule(rID16, values((yes, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, second, second, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων δείχνουν Προδιαβήτη Τύπου 2.'). 

rule(rID17, values((yes, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, second, second, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων δείχνουν Προδιαβήτη Τύπου 2.'). 

rule(rID18, values((yes, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, second, second, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων δείχνουν Προδιαβήτη Τύπου 2.'). 

rule(rID19, values((yes, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, second, second, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων δείχνουν Προδιαβήτη Τύπου 2.'). 

rule(rID20, values((yes, no, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, second, second, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων δείχνουν Προδιαβήτη Τύπου 2.'). 

rule(rID21, values((yes, no, no, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, second, second, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων δείχνουν Προδιαβήτη Τύπου 2.'). 

rule(rID22, values((yes, no, no, no, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, second, second, _, _ )), 'ΔΙΑΓΝΩΣΗ: Οι τιμές των εξετάσεων δείχνουν Προδιαβήτη Τύπου 2.'). 

 

% Asthenis me SD Typou 1 

rule(rID23, values((yes, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, third, third, yes, yes )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 1. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 1 χρίζει απαραίτητης χορήγησης ινσουλίνης. Η πιο κοινή μορφή χορήγησης της είναι η ενέσιμη. Επίσης, είναι απαραίτητος ο τακτικός έλεγχος των επιπέδων σακχάρου στο αίμα καθώς και η καταμέτριση των ποσοτήτων των τροφών που καταλαμβάνονται, και κυρίως των υδατανθράκων, αφού αυτές καθορίζουν την ποσότητα ινσουλίνης που θα χρειαστεί να λάβει ο ασθενής για την εξισορρόπιση των επιπέδων σακχάρου στο αίμα. Η χορήγηση ινσουλίνης, σε συνδυασμό με την υγιεινή διατροφή και σωματική άσκηση, πρέπει να διατηρούνται σε ισορροπία, διαφορετικά υπάρχει κίνδυνος εμφάνισης μεγάλων διακυμάνσεων των επιπέδων σακχάρου στο αίμα.'). 

rule(rID24, values((yes, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, third, third, yes, yes )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 1. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 1 χρίζει απαραίτητης χορήγησης ινσουλίνης. Η πιο κοινή μορφή χορήγησης της είναι η ενέσιμη. Επίσης, είναι απαραίτητος ο τακτικός έλεγχος των επιπέδων σακχάρου στο αίμα καθώς και η καταμέτριση των ποσοτήτων των τροφών που καταλαμβάνονται, και κυρίως των υδατανθράκων, αφού αυτές καθορίζουν την ποσότητα ινσουλίνης που θα χρειαστεί να λάβει ο ασθενής για την εξισορρόπιση των επιπέδων σακχάρου στο αίμα. Η χορήγηση ινσουλίνης, σε συνδυασμό με την υγιεινή διατροφή και σωματική άσκηση, πρέπει να διατηρούνται σε ισορροπία, διαφορετικά υπάρχει κίνδυνος εμφάνισης μεγάλων διακυμάνσεων των επιπέδων σακχάρου στο αίμα.'). 

rule(rID25, values((yes, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, third, third, yes, yes )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 1. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 1 χρίζει απαραίτητης χορήγησης ινσουλίνης. Η πιο κοινή μορφή χορήγησης της είναι η ενέσιμη. Επίσης, είναι απαραίτητος ο τακτικός έλεγχος των επιπέδων σακχάρου στο αίμα καθώς και η καταμέτριση των ποσοτήτων των τροφών που καταλαμβάνονται, και κυρίως των υδατανθράκων, αφού αυτές καθορίζουν την ποσότητα ινσουλίνης που θα χρειαστεί να λάβει ο ασθενής για την εξισορρόπιση των επιπέδων σακχάρου στο αίμα. Η χορήγηση ινσουλίνης, σε συνδυασμό με την υγιεινή διατροφή και σωματική άσκηση, πρέπει να διατηρούνται σε ισορροπία, διαφορετικά υπάρχει κίνδυνος εμφάνισης μεγάλων διακυμάνσεων των επιπέδων σακχάρου στο αίμα.'). 

rule(rID26, values((yes, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, third, third, yes, yes )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 1. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 1 χρίζει απαραίτητης χορήγησης ινσουλίνης. Η πιο κοινή μορφή χορήγησης της είναι η ενέσιμη. Επίσης, είναι απαραίτητος ο τακτικός έλεγχος των επιπέδων σακχάρου στο αίμα καθώς και η καταμέτριση των ποσοτήτων των τροφών που καταλαμβάνονται, και κυρίως των υδατανθράκων, αφού αυτές καθορίζουν την ποσότητα ινσουλίνης που θα χρειαστεί να λάβει ο ασθενής για την εξισορρόπιση των επιπέδων σακχάρου στο αίμα. Η χορήγηση ινσουλίνης, σε συνδυασμό με την υγιεινή διατροφή και σωματική άσκηση, πρέπει να διατηρούνται σε ισορροπία, διαφορετικά υπάρχει κίνδυνος εμφάνισης μεγάλων διακυμάνσεων των επιπέδων σακχάρου στο αίμα.'). 

rule(rID27, values((yes, no, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, third, third, yes, yes )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 1. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 1 χρίζει απαραίτητης χορήγησης ινσουλίνης. Η πιο κοινή μορφή χορήγησης της είναι η ενέσιμη. Επίσης, είναι απαραίτητος ο τακτικός έλεγχος των επιπέδων σακχάρου στο αίμα καθώς και η καταμέτριση των ποσοτήτων των τροφών που καταλαμβάνονται, και κυρίως των υδατανθράκων, αφού αυτές καθορίζουν την ποσότητα ινσουλίνης που θα χρειαστεί να λάβει ο ασθενής για την εξισορρόπιση των επιπέδων σακχάρου στο αίμα. Η χορήγηση ινσουλίνης, σε συνδυασμό με την υγιεινή διατροφή και σωματική άσκηση, πρέπει να διατηρούνται σε ισορροπία, διαφορετικά υπάρχει κίνδυνος εμφάνισης μεγάλων διακυμάνσεων των επιπέδων σακχάρου στο αίμα.'). 

rule(rID28, values((yes, no, no, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, third, third, yes, yes )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 1. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 1 χρίζει απαραίτητης χορήγησης ινσουλίνης. Η πιο κοινή μορφή χορήγησης της είναι η ενέσιμη. Επίσης, είναι απαραίτητος ο τακτικός έλεγχος των επιπέδων σακχάρου στο αίμα καθώς και η καταμέτριση των ποσοτήτων των τροφών που καταλαμβάνονται, και κυρίως των υδατανθράκων, αφού αυτές καθορίζουν την ποσότητα ινσουλίνης που θα χρειαστεί να λάβει ο ασθενής για την εξισορρόπιση των επιπέδων σακχάρου στο αίμα. Η χορήγηση ινσουλίνης, σε συνδυασμό με την υγιεινή διατροφή και σωματική άσκηση, πρέπει να διατηρούνται σε ισορροπία, διαφορετικά υπάρχει κίνδυνος εμφάνισης μεγάλων διακυμάνσεων  των επιπέδων σακχάρου στο αίμα.'). 

rule(rID29, values((yes, no, no, no, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, third, third, yes, yes )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 1. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 1 χρίζει απαραίτητης χορήγησης ινσουλίνης. Η πιο κοινή μορφή χορήγησης της είναι η ενέσιμη. Επίσης, είναι απαραίτητος ο τακτικός έλεγχος των επιπέδων σακχάρου στο αίμα καθώς και η καταμέτριση των ποσοτήτων των τροφών που καταλαμβάνονται, και κυρίως των υδατανθράκων, αφού αυτές καθορίζουν την ποσότητα ινσουλίνης που θα χρειαστεί να λάβει ο ασθενής για την εξισορρόπιση των επιπέδων σακχάρου στο αίμα. Η χορήγηση ινσουλίνης, σε συνδυασμό με την υγιεινή διατροφή και σωματική άσκηση, πρέπει να διατηρούνται σε ισορροπία, διαφορετικά υπάρχει κίνδυνος εμφάνισης μεγάλων διακυμάνσεων  των επιπέδων σακχάρου στο αίμα.'). 

 

% Asthenis me SD Typou 2 

rule(rID30, values((yes, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2 μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους  αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων  οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα.   Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει  ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35%  σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 

rule(rID31, values((yes, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2  μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών  φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων  οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα.  Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει   ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35%  σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 

rule(rID32, values((yes, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2  μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών  φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους  αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων  οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα. Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35% σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 

rule(rID33, values((yes, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, _, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2  μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών  φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους  αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα.  Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35%  σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 

rule(rID34, values((yes, no, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, _, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2 μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών  φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους   αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων   οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα.   Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35% σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 

rule(rID35, values((yes, no, no, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, _, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2 μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών  φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους  αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων  οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα. Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει  ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35%  σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 

rule(rID36, values((yes, no, no, no, no, no, no, yes, _, _, _, _, _, _, _, _, _, _, _, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2  μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών   φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους  αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων  οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα. Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει  ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35%  σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 

 

% Asthenis xoris aisthita simptomata kai xoris kindinous 

rule(rID37, values((no, _, _, _, _, _, _, _, no, no, no, no, no, no, no, no, no, no, no, _, _, _, _ )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής δεν φαίνεται να διατρέχει κίνδυνο ΣΔ.'). 

 

% Asthenis me kindino kai SD Typou 2 

rule(rID38, values((no, _, _, _, _, _, _, _, yes, _, _, _, _, _, _, _, _, _, _, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2 μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών  φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων  οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα. Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει   ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35%   σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 

rule(rID39, values((no, _, _, _, _, _, _, _, no, yes, _, _, _, _, _, _, _, _, _, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2  μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών    φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους   αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα.  Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35%   σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 

rule(rID40, values((no, _, _, _, _, _, _, _, no, no, yes, _, _, _, _, _, _, _, _, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2  μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών  φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους  αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων  οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα.  Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35%   σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 

rule(rID41, values((no, _, _, _, _, _, _, _, no, no, no, yes, _, _, _, _, _, _, _, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2  μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών   φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους  αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων  οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα.  Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει   ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35%  σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 

 

rule(rID42, values((no, _, _, _, _, _, _, _, no, no, no, no, yes, _, _, _, _, _, _, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2   μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών  φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους  αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων   οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα.   Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει   ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35%   σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 

rule(rID43, values((no, _, _, _, _, _, _, _, no, no, no, no, no, yes, _, _, _, _, _, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2  μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών  φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους  αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων   οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα.  Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει  ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35%   σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 

 

rule(rID44, values((no, _, _, _, _, _, _, _, no, no, no, no, no, no, yes, _, _, _, _, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2  μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών    φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους    αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων   οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα.  Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει  ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35%    σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 

rule(rID45, values((no, _, _, _, _, _, _, _, no, no, no, no, no, no, no, yes, _, _, _, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2   μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών    φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους    αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων   οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα.   Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει  ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35%  σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 

rule(rID46, values((no, _, _, _, _, _, _, _, no, no, no, no, no, no, no, no, yes, _, _, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2   μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών  φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους  αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων  οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα.  Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει  ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35%  σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 

rule(rID47, values((no, _, _, _, _, _, _, _, no, no, no, no, no, no, no, no, no, yes, _, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2  μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών  φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους  αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων   οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα.   Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει   ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35%  σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 

rule(rID48, values((no, _, _, _, _, _, _, _, no, no, no, no, no, no, no, no, no, no, yes, third, third, yes, no )), 'ΔΙΑΓΝΩΣΗ: Ο Ασθενής φαίνεται να έχει ΣΔ Τύπου 2. ΘΕΡΑΠΕΙΑ: Ο ΣΔ Τύπου 2  μπορεί να αντιμετωπιστεί με διάφορες φαρμακευτικές μεθόδους, με πολλές να λαμβάνονται από το στόμα. Η θεραπεία ξεκινά συνήθως με κάποιον από τους τύπους αντιδιαβητικών   φαρμάκων, συνεχίζοντας με θεραπεία συνδυασμού και τελειώνει συχνά με ενέσιμη θεραπεία, όταν δεν παρέχεται πλέον επαρκής έλεγχος της γλυκόζης του αίματος από τους αντιδιαβητικούς παράγοντες. Επίσης, η διατροφή και η σωματική άσκηση είναι πολύ σημαντικά κομμάτια ενός υγιεινού τρόπου ζωής όταν κάποιος έχει Διαβήτη. Πέρα των υπολοίπων   οφελών, η σωματική άσκηση σε συνδυασμό με μια ισορροπημένη και υγιεινή διατροφή μπορούν να βοηθήσουν στην ρύθμιση των επιπέδων σακχάρου στο αίμα στα προσδοκόμενα επίπεδα.  Στην παραπάνω ρύθμιση συμβάλλει ακόμη το είδος της τροφής, η ποσότητα και πότε τρέφεται το άτομο. Όσον αφορά τις μερίδες φαγητού, η Αμερικανική Ένωση Διαβήτη προτείνει ποσοστό 45%-65% του συνόλου του ημερησίου αριθμού θερμίδων να προέρχεται από υδατάνθρακες, 25%-35% σε μορφή λιπαρών (εκ των οποίων <7% από κορεσμένα λιπαρά) , και 10-35% σε μορφή πρωτεΐνης. Τέλος, σε περίπτωση που ο ασθενής είναι υπέρβαρος ή παχύσαρκος, είναι σημαντικό να δημιουργηθεί ένα πρόγραμμα απώλειας βάρους.'). 